MDFreak/md_tinyhouse_ESP32/src/prj_tiny_base_devkit.h
/*************************************************************************
|* filename:   prj_tiny_base_devkit.h
 * project:    part of standard utilities
 * author:     Martin DORFNER (MD)
 * maintainer: Martin DORFNER
 * email:      git@martin-dorfner.at
 * Date:       10.12.2023
 *-----------------------------------------------------------------------
 * function:
 *   complete set of tinyhouse implementations for ESP32
 *   - read and control Bluetti photo voltaic and energy management
 *   - ? read and control Daikin AC unit (? HomeAssistent)
 *   - exchange data with RaspberryPi using MQTT
 *   - measure internal power usage
 *   - measure envirnment data
 *   - ? read detailed measurement data from PV inputs
 *   - control energy flow
 *   - control airflow for climate and humidity
 * used hardware:
 *   - controller: ESP32_D1_R32 (az-delivery)
 *   - display   : OLED display (0.96" 128x64)
 *   - FRAM      : 32k
 *   - power meas: INA3221 (3 chan, Vin, 5V, 3.3V)
 *   - sd-card
 +   - DC-DC to produce 5.2V for stable power supply
 *-----------------------------------------------------------------------
 * external dependancies:
 *   ext dependancies are set in 'platformio.h', depend on projects
 *-----------------------------------------------------------------------
 * internal dependancies:
 *   - transfer C-type statement with make statement
 *     use VSCode/PlatformIO
 *        -> 'platformio.h'
 *           -> [env:<project_name>]
 *                i.e. build_flags = -D USE_MD_IP_LIST=1
 *   - md_defines.h  (utility intern)
 *-----------------------------------------------------------------------
 * state of coding:
 *   - initial coding
 *   - already tested
 *     - OLED displays
 *       - MC_UO_OLED_066_AZ ; -> ok
 *       - MC_UO_OLED_091_AZ ; -> ok
 *       - MC_UO_OLED_096_AZ ; -> ok
 *       - MC_UO_OLED_130_AZ ; -> ok
 *     - sensors
 *       - BME280_I2C (T,H,P)    ; -> ok
 *       - ADC1115_I2C           ; -> to implement
 *       - INA3221_I2C           ; -> to implement
 *     - network    (not up to date)
 *       - WiFi              ; -> to implement
 *       - NTPserver         ; -> to implement
 *       - webserver         ; -> to implement
 *       - MQTT              ; -> to implement
 *   - TODO
 *     - display
 *       - local output      ; -> to organise
 *     - outputs
 *       - fan_pwm               ; -> to implement
 *       - dig_out_general       ; -> to implement
 *     - sensors
 *       - DS18B20_1W_IO         ; -> to implement
 *       - PHOTO_SENS_ANA        ; -> to implement
 *       - POTI_ANA              ; -> to implement
 *     - network
 *       - WiFi              ; -> to implement
 *       - NTPserver         ; -> to implement
 *       - webserver         ; -> to implement
 *       - MQTT              ; -> to implement
 *-----------------------------------------------------------------------
 * description
 *   - for every device there is testing project
 *   - normally a project uses one of the displays for output
 ************************************************************************
 * Version| Date   | Changes                                    | Autor
 *-----------------------------------------------------------------------
 * 0.001  |04.03.24| import from library test project           | MD
*-----------------------------------------------------------------------*/

#include <Arduino.h>
#include <md_defines.h>
#include <md_projects.h>

#if (PROJECT == PRJ_TINY_BASE_DEVKIT)

    #ifndef _PRJ_TINY_BASE_DEVKIT_H_
        #define _PRJ_TINY_BASE_DEVKIT_H_
      #endif
    // system globals
      #ifndef PRJ_TINY_BASE_DEVKIT_VERSION
          #define TINY_BASE_DEVKIT_VERSION "V0.0.1"
        #endif
    // ******************************************
    // --- define board, used devices and pins
      // --- system
        #define SER_BAUDRATE ESP_SER_BAUD
        #if (USE_LED_BLINK_OUT > 0)
            #define BLINKTIME_MS  1200ul
            #define BLINKPWM_FREQ 400
            #define BLINKPWM_RES  8
            #if (PRJ_BOARD == MC_ESP32_NODE)
                #ifndef PIN2
                    #define PIN_BOARD_LED    2 // NC
                    #define PIN2
                  #else
                    PIN2 adready used
                  #endif
              #endif
          #endif // USE_LED_BLINK_OUT
      // --- I2C interface
        //#define SCAN_I2C          OFF // 128
        #ifdef USE_I2C
            #ifndef USE_DISP
                #define USE_DISP
              #endif
            #if (USE_OLED_I2C > OFF)
                #define OLED_I2C_ADDR  I2C_OLED_3C
                #define OLED_I2C       DEV_I2C1
                #define OLED_I2C_SCL   PIN_I2C1_SCL
                #define OLED_I2C_SDA   PIN_I2C1_SDA
                // select OLED - device & GEO   GEO_RAWMODE?
                          // MC_UO_OLED_066_AZ   GEO_64_48    OLED_DRV_1306
                          // MC_UO_OLED_091_AZ   GEO_128_32   OLED_DRV_1306
                          // MC_UO_OLED_096_AZ   GEO_128_64   OLED_DRV_1306
                          // MC_UO_OLED_130_AZ   GEO_128_64   OLED_DRV_1106
                #define OLED_I2C_TYP MC_UO_OLED_096_AZ  // OLED1 on DEV_I2C1
                  #if (OLED_I2C_TYP == MC_UO_OLED_066_AZ)
                      #define DISP_MAXCOLS   OLED_066_MAXCOLS
                      #define DISP_MAXROWS   OLED_066_MAXROWS
                      #define OLED_GEO       GEO_64_48
                      #define OLED_DRV       OLED_DRV_1306
                    #endif
                  #if (OLED_I2C_TYP == MC_UO_OLED_091_AZ)
                      #define DISP_MAXCOLS   OLED_091_MAXCOLS
                      #define DISP_MAXROWS   OLED_091_MAXROWS
                      #define OLED_GEO       GEO_128_32
                      #define OLED_DRV       OLED_DRV_1306
                    #endif
                  #if (OLED_I2C_TYP == MC_UO_OLED_096_AZ)
                      #define DISP_MAXCOLS   OLED_096_MAXCOLS
                      #define DISP_MAXROWS   OLED_096_MAXROWS
                      #define OLED_GEO       GEO_128_64
                      #define OLED_DRV       OLED_DRV_1306
                    #endif
                  #if (OLED_I2C_TYP == MC_UO_OLED_130_AZ)
                      #define DISP_MAXCOLS   OLED_130_MAXCOLS
                      #define DISP_MAXROWS   OLED_130_MAXROWS
                      #define OLED_GEO       GEO_128_64
                      #define OLED_DRV       OLED_DRV_1106
                    #endif // OLED_I2C_TYP
                // #define OLED_FLIP_VERTICAL TRUE
                #if (OLED_I2C == DEV_I2C1)
                    #ifndef I2C1
                        #define I2C1
                      #endif //I2C1
                  #endif // OLED_I2C
                #if (OLED_I2C == DEV_I2C2)
                    #ifndef I2C2
                        #define I2C2
                      #endif //I2C2
                  #endif // OLED_I2C
              #endif // USE_OLED_I2C
            // --- I2C board connection
            #if (USE_FRAM_I2C > OFF)
                #define FRAM_I2C_ADDR      I2C_FRAM_50
                #define FRAM_I2C           DEV_I2C1
                #define FRAM1_I2C_SCL      PIN_I2C1_SCL
                #define FRAM1_I2C_SDA      PIN_I2C1_SDA
                #define FRAM_SIZE          0x8000u
                #if (FRAM_I2C == DEV_I2C1)
                    #ifndef I2C1
                        #define I2C1
                      #endif //I2C1
                  #endif // OLED_I2C
                #if (FRAM_I2C == DEV_I2C2)
                    #ifndef I2C2
                        #define I2C2
                      #endif //I2C2
                  #endif // OLED_I2C
              #endif
            #if defined(USE_CCS811_I2C)
                //    #define CCS811_I2C_ADDR     I2C_CSS811_
                //    #define CCS811_I2C          DEV_I2C1
              #endif
            #if defined(USE_BME680_I2C)
                #define BME680_I2C               DEV_I2C1
                #define BME680_ADDR              I2C_BME680_77
                #define BME680_RUNMODE           MD_NORM
                //#define BME680_RUNMODE           MD_SIM
                #define BME680T_FILT             0
                #define BME680T_Drop             0
                #define BME680P_FILT             0
                #define BME680P_Drop             0
                #define BME680H_FILT             0
                #define BME680H_Drop             0
                #define BME680G_FILT             0
                #define BME680G_Drop             0
                #if (USE_MQTT > OFF)
                    #define MQTT_BME680T         "bme680t1"
                    #define MQTT_BME680P         "bme680p1"
                    #define MQTT_BME680H         "bme680h1"
                    #define MQTT_BME680G         "bme680g1"
                  #endif
                #ifndef USE_INPUT_CYCLE
                    #define USE_INPUT_CYCLE
                  #endif
                #ifndef USE_OUTPUT_CYCLE
                    #define USE_OUTPUT_CYCLE
                  #endif
                    /* analog channels
                      ADC channels
                        ***_ADC_RES 12                    --> resolution 12 bit (def)
                        ***_ADC_ATT  ADC_ATTEN_DB_0   -->  range 0 -  800 mV
                        ***_ADC_ATT  ADC_ATTEN_DB_2_5 -->  range 0 - 1100 mV
                        ***_ADC_ATT  ADC_ATTEN_DB_6   -->  range 0 - 1350 mV
                        ***_ADC_ATT  ADC_ATTEN_DB_11  -->  range 0 - 2600 mV (def)
                      ADS1115 channels
                        ***_1115_ATT GAIN_TWOTHIRDS --> range +/-6144mV - 187.5    uV/bit
                        ***_1115_ATT GAIN_ONE       --> range +/-4096mV - 125      uV/bit
                        ***_1115_ATT GAIN_TWO (def) --> range +/-2048mV -  62.5    uV/bit
                        ***_1115_ATT GAIN_FOUR      --> range +/-1024mV -  31.25   uV/bit
                        ***_1115_ATT GAIN_EIGHT     --> range +/- 512mV -  15.625  uV/bit
                        ***_1115_ATT GAIN_SIXTEEN   --> range +/- 256mV -   7.8125 uV/bit
                      ADS1115 datarates
                        RATE_ADS1115_8SPS         8 samples per second
                        RATE_ADS1115_16SPS       16 samples per second
                        RATE_ADS1115_32SPS       32 samples per second
                        RATE_ADS1115_64SPS       64 samples per second
                        RATE_ADS1115_128SPS      128 samples per second (default)
                        RATE_ADS1115_250SPS      250 samples per second
                        RATE_ADS1115_475SPS      475 samples per second
                        RATE_ADS1115_860SPS      860 samples per second
                      scaling parameters and calculation
                      *pValue = (  (*pValue + (double) *_SCAL_OFFRAW)
                                 * (double)*_SCAL_GAIN
                                 + (double) *_SCAL_OFFRREAL
                            )
                    */
              #define BME680_I2C         DEV_I2C1
              #if (BME680_I2C == DEV_I2C1)
                  #ifndef I2C1
                      #define I2C1
                    #endif //I2C1
                #endif
              #if (BME680_I2C == DEV_I2C2)
                  #ifndef I2C2
                      #define I2C2
                    #endif //I2C2
                #endif
              #endif
            #if defined(USE_BME280_I2C)
                #define BME280_I2C         DEV_I2C1
                #if (BME280_I2C == DEV_I2C1)
                    #ifndef I2C1
                        #define I2C1
                      #endif //I2C1
                  #endif
                #if (BME280_I2C == DEV_I2C2)
                    #ifndef I2C2
                        #define I2C2
                      #endif //I2C2
                  #endif
                #define BME280_ADDR              I2C_BME280_76
                #define BME280_RUNMODE           MD_NORM
                //#define BME280_RUNMODE           MD_SIM
                #define BME280T_FILT             0
                #define BME280T_Drop             0
                #define BME280P_FILT             0
                #define BME280P_Drop             0
                #define BME280H_FILT             0
                #define BME280H_Drop             0
                #if (USE_MQTT > OFF)
                    #define MQTT_BME280T         "bme280t1"
                    #define MQTT_BME280P         "bme280p1"
                    #define MQTT_BME280H         "bme280h1"
                  #endif
                #ifndef USE_INPUT_CYCLE
                    #define USE_INPUT_CYCLE
                  #endif
                #ifndef USE_OUTPUT_CYCLE
                    #define USE_OUTPUT_CYCLE
                  #endif
              #endif
            #if defined(USE_PZEM017_RS485)
                // types
                  #define PZEM_I_DC10   10
                  #define PZEM_I_DC50   50
                  #define PZEM_I_AC10  -10
                  //#define PZEM_SHUNT_10A 31
                  //#define PZEM_SHUNT_50A 32
                  //#define PZEM_SHUNT_10A 41
                #define NUM_PZEMS       USE_PZEM017_RS485
                #define MIN_PZEM003     16
                #define MAX_PZEM003     31
                #define MIN_PZEM004     32
                #define MAX_PZEM004     39
                #define MIN_PZEM017     8
                #define MAX_PZEM017     15
                #define MAX_PZEMS       39   //
                #define PZEM_SER        DEV_SER2
                #define PZEM_DEF_ADDR   1
                #define PZEM_TRIG_MS    1000u    // trigger time [ms]
                #if (PZEM_SER == DEV_SER1)
                    #ifndef COMM1
                        #define COMM1
                      #endif
                  #endif
                #if (PZEM_SER == DEV_SER2)
                    #ifndef COMM2
                        #define COMM2
                      #endif
                  #endif
                #ifndef PIN33
                    #define PIN_PZEM1_RTS 33
                    #define PIN33
                #else
                    PIN27 adready used
                  #endif // PIN27
                // devices
                  #if defined(PZEM_1_ADDR)
                      #if (PZEM_1_ADDR < 16)
                          #define PZEM_1_I    PZEM_I_DC50
                          #define PZEM_1_TYPE PZEM_SHUNT_50A
                      #elif (PZEM_1_ADDR < 32)
                          #define PZEM_1_I    PZEM_I_DC10
                          #define PZEM_1_TYPE PZEM_SHUNT_10A
                      #elif (PZEM_1_ADDR < 40)
                          #define PZEM_1_I    PZEM_I_AC10
                          #define PZEM_1_TYPE PZEM_SHUNT_10A
                        #endif
                    #endif
                  #if defined(PZEM_2_ADDR)
                      #if (PZEM_2_ADDR < 16)
                          #define PZEM_2_I    PZEM_I_DC50
                          #define PZEM_2_TYPE PZEM_SHUNT_50A
                      #elif (PZEM_2_ADDR < 32)
                          #define PZEM_2_I    PZEM_I_DC10
                          #define PZEM_2_TYPE PZEM_SHUNT_10A
                      #elif (PZEM_2_ADDR < 40)
                          #define PZEM_2_I    PZEM_I_AC10
                          #define PZEM_2_TYPE PZEM_SHUNT_10A
                        #endif
                    #endif
                  #if defined(PZEM_3_ADDR)
                      #if (PZEM_3_ADDR < 16)
                          #define PZEM_3_I    PZEM_I_DC50
                          #define PZEM_3_TYPE PZEM_SHUNT_50A
                      #elif (PZEM_3_ADDR < 32)
                          #define PZEM_3_I    PZEM_I_DC10
                          #define PZEM_3_TYPE PZEM_SHUNT_10A
                      #elif (PZEM_3_ADDR < 40)
                          #define PZEM_3_I    PZEM_I_AC10
                          #define PZEM_3_TYPE PZEM_SHUNT_10A
                        #endif
                    #endif
                  #if defined(PZEM_4_ADDR)
                      #if (PZEM_4_ADDR < 16)
                          #define PZEM_4_I    PZEM_I_DC50
                          #define PZEM_4_TYPE PZEM_SHUNT_50A
                      #elif (PZEM_4_ADDR < 32)
                          #define PZEM_4_I    PZEM_I_DC10
                          #define PZEM_4_TYPE PZEM_SHUNT_10A
                      #elif (PZEM_4_ADDR < 40)
                          #define PZEM_4_I    PZEM_I_AC10
                          #define PZEM_4_TYPE PZEM_SHUNT_10A
                        #endif
                    #endif
                #ifndef USE_INPUT_CYCLE
                    #define USE_INPUT_CYCLE
                  #endif
                #ifndef USE_OUTPUT_CYCLE
                    #define USE_OUTPUT_CYCLE
                  #endif
              #endif
            #if (USE_ADC1115_I2C > OFF)
                #define ADS_I2C          DEV_I2C1
                #define ADS1_RUNMODE     MD_NORM
                //#define ADS1_RUNMODE     MD_SIM
                #define ADS1_ADDR        I2C_ADS1115_48
                #define ADS1_ANZ_CHANS   4
                #if (USE_ADC1115_I2C > 1)
                    #define ADS2_ADDR        I2C_ADS1115_48 //I2C_ADS1115_49
                    #define ADS2_ANZ_CHANS    4
                    #if (USE_ADC1115_I2C > 2)
                        #define ADS3_ADDR        I2C_ADS1115_48 //I2C_ADS1115_4A
                        #define ADS3_ANZ_CHANS    4
                        #if (USE_ADC1115_I2C > 3)
                            #define ADS4_ADDR        I2C_ADS1115_48 //I2C_ADS1115_4B
                            #define ADS4_ANZ_CHANS    4
                          #endif
                      #endif
                  #endif
              #endif
            #if (USE_CCS811_I2C > OFF)
                #define CCS811_I2C                DEV_I2C1
                #define CCS811C_FILT              0  // eCO2 value in air
                #define CCS811C_Drop              0  // [0 - 32768 ppm]
                #define CCS811T_FILT              0  // TVOC value carbon value in air
                #define CCS811T_Drop              0  // [400 - 29206 ppm]
                #if (USE_MQTT > OFF)
                    #define MQTT_CCS811T         "ccs811t"
                    #define MQTT_CCS811C         "ccs811c"
                  #endif
                #ifndef USE_INPUT_CYCLE
                    #define USE_INPUT_CYCLE
                  #endif
              #endif
            #ifdef USE_INA3221_I2C
                #define INA3221_I2C               DEV_I2C1
                #define INA3221_ADDR              I2C_INA3221_40
                #define INA3221U1_ACT             1  // voltage in1+ activ
                #if (INA3221U1_ACT > OFF)
                    #define INA3221U1_FILT            0  // voltage in1+
                    #define INA3221U1_DROP            0  // [0 - 26000 mV]
                  #endif // INA3221U1_ACT
                #define INA3221I1_ACT             1  // current in1
                #if (INA3221I1_ACT > OFF)
                    #define INA3221I1_FILT            0  // current in1
                    #define INA3221I1_DROP            0  // [-5000 - +5000 mA]
                  #endif // INA3221I1_ACT
                #define INA3221U2_ACT             1  // voltage in2+ activ
                #if (INA3221U2_ACT > OFF)
                    #define INA3221U2_FILT            0  // voltage in2+
                    #define INA3221U2_DROP            0  // [0 - 26000 mV]
                  #endif // INA3221U2_ACT
                #define INA3221I2_ACT             1  // current in2
                #if (INA3221I2_ACT > OFF)
                    #define INA3221I2_FILT            0  // current in2
                    #define INA3221I2_DROP            0  // [-5000 - +5000 mA]
                  #endif // INA3221I2_ACT
                #define INA3221U3_ACT             1  // voltage in3+ activ
                #if (INA3221U3_ACT > OFF)
                    #define INA3221U3_FILT            0  // voltage in3+
                    #define INA3221U3_DROP            0  // [0 - 26000 mV]
                  #endif // INA3221U3_ACT
                #define INA3221I3_ACT             1  // current in3
                #if (INA3221I3_ACT > OFF)
                    #define INA3221I3_FILT            0  // current in3
                    #define INA3221I3_DROP            0  // [-5000 - +5000 mA]
                  #endif // INA3221I3_ACT
                #if (INA3221_I2C == DEV_I2C1)
                    #ifndef I2C1
                        #define I2C1
                      #endif //I2C1
                  #endif
                #if (USE_MQTT > OFF)
                    #define MQTT_ina3221U1         "ina3221u1"
                    #define MQTT_ina3221I1         "ina3221i1"
                    #define MQTT_ina3221P1         "ina3221p1"
                    #define MQTT_ina3221U2         "ina3221u2"
                    #define MQTT_ina3221I2         "ina3221i2"
                    #define MQTT_ina3221P2         "ina3221p2"
                    #define MQTT_ina3221U3         "ina3221u3"
                    #define MQTT_ina3221I3         "ina3221i3"
                    #define MQTT_ina3221P3         "ina3221p3"
                    #define MQTT_INA32212U1         "ina32212u1"
                    #define MQTT_INA32212I1         "ina32212i1"
                    #define MQTT_INA32212P1         "ina32212p1"
                    #define MQTT_INA32212U2         "ina32212u2"
                    #define MQTT_INA32212I2         "ina32212i2"
                    #define MQTT_INA32212P2         "ina32212p2"
                    #define MQTT_INA32212U3         "ina32212u3"
                    #define MQTT_INA32212I3         "ina32212i3"
                    #define MQTT_INA32212P3         "ina32212p3"
                    #define MQTT_INA32213U1         "ina32213u1"
                    #define MQTT_INA32213I1         "ina32213i1"
                    #define MQTT_INA32213P1         "ina32213p1"
                    #define MQTT_INA32213U2         "ina32213u2"
                    #define MQTT_INA32213I2         "ina32213i2"
                    #define MQTT_INA32213P2         "ina32213p2"
                    #define MQTT_INA32213U3         "ina32213u3"
                    #define MQTT_INA32213I3         "ina32213i3"
                    #define MQTT_INA32213P3         "ina32213p3"
                  #endif // USE_MQTT > OFF
              #endif      //  #endif
            // define board pins at the end
            #if (PRJ_BOARD == MC_ESP32_NODE)
                #ifdef I2C1
                    #ifndef PIN21
                        #define PIN_I2C1_SDA       21
                        #define PIN21
                      #else
                        PIN21 adready used
                      #endif // PIN21
                    #ifndef PIN22
                        #define PIN_I2C1_SCL       22
                        #define PIN22
                      #else
                        PIN22 adready used
                      #endif // PIN22
                  #endif // I2C1
                #ifdef I2C2
                    #ifndef PIN21
                        #define PIN_I2C2_SDA       21
                        #define PIN21
                      #else
                        PIN21 adready used
                      #endif
                    #ifndef PIN22
                        #define PIN_I2C2_SCL       22
                        #define PIN22
                      #else
                        PIN22 adready used
                      #endif
                  #endif // I2C2
                #ifdef COMM1
                    #ifndef PIN17
                        #define PIN_COMM1_TX 17
                        #define PIN17
                      #else
                        PIN17 adready used
