MDFreak/md_tinyhouse_ESP32/src/prj_tiny_base_devkit.h
                      #endif // PIN17
                    #ifndef PIN16
                        #define PIN_COMM1_RX 16
                        #define PIN16
                      #else
                        PIN16 adready used
                      #endif // PIN16
                  #endif
                #ifdef COMM2
                    #ifndef PIN17
                        #define PIN_COMM2_TX 17
                        #define PIN17
                      #else
                        PIN17 adready used
                      #endif // PIN17
                    #ifndef PIN16
                        #define PIN_COMM2_RX 16
                        #define PIN16
                      #else
                        PIN16 adready used
                      #endif // PIN16
                  #endif
              #endif //PRJ_BOARD
            #else
                #if defined(I2C1)
                    #define PIN_I2C1_SDA          21
                    #define PIN_I2C1_SCL          22
                  #endif // I2C1
                #if defined(I2C2)
                    #define PIN_I2C2_SDA          !21
                    #define PIN_I2C2_SCL          !22
                  #endif // I2C1
          #endif // USE_I2C
      // --- SPI interface
        #ifdef USE_SPI
            #if (PRJ_BOARD == MC_ESP32_NODE)
                #ifdef SPI_MOSI  // PIN_SPI_MOSI
                    #define PIN_SPI_MOSI           SPI_MOSI
                  #else
                    #ifndef PIN23
                        #define PIN_SPI_MOSI           23
                        #define PIN23
                    #else
                        PIN23 adready used
                      #endif
                  #endif // PIN23
                #ifdef SPI_MISO  // PIN_SPI_MOSI
                      #define PIN_SPI_MISO           SPI_MISO
                  #else
                    #ifndef PIN19 // PIN_SPI_MISO
                        #define PIN_SPI_MISO       19
                        #define PIN19
                      #else
                        PIN19 adready used
                      #endif // PIN19
                  #endif
                #ifdef SPI_SCLK  // PIN_SPI_SCLK
                      #define PIN_SPI_SCLK           SPI_SCLK
                  #else
                    #ifndef PIN18 // PIN_SPI_SCLK
                        #define PIN_SPI_SCLK        18
                        #define PIN18
                      #else
                        PIN18 adready used
                      #endif // PIN18
                  #endif
              #endif //PRJ_BOARD
            #ifdef  USE_TFT
                // TFTs
                  //MC_UO_TFT1602_I2C_XA   // 0x1401u
                  //MC_UO_TFT1602_GPIO_RO  // 0x3402u used by KEYPADSHIELD
                  //MC_UO_TXPT2046_AZ_SPI  // 0x1403u used by Arduino-touch-case
                  //MC_UO_TXPT2046_AZ_UNO  // 0x1404u used by Arduino-touch-case
                  //MC_UO_Keypad_ANA0_RO   // 0x3405u used by KEYPADSHIELD
                  //MC_UO_TFT_GC9A01A_SPI  // 0x1406u round display 240x240 16bit color
                // TFT shpuld be defined in 'platformio.h' with defines from TFT_eSPI.h
                #ifdef UNUSED // (TFT_TYP == MC_UO_TOUCHXPT2046_AZ)
                    #define DISP_ORIENT    3      // 0:USB oben, 1:USB links, 2:USB unten, 3:USB rechts
                    //        #define DATE_DISP_COL  0
                        //        #define DATE_DISP_LINE 9      // line on display for date / time
                        //        // text display area
                        //        #define DISP_X         0
                        //        #define DISP_Y         0
                        //        #define DISP_W         240
                        //        #define DISP_H         300
                        //        #define DISP_BCOL      0x000F // TFT_NAVY
                        //        #define DISP_ANZ_SP    20
                        //        #define DISP_ANZ_ZE    12
                        //        #define DISP_Hoe_ZE    25
                        //        #define DISP_TX_FCOL   0xB7E0 // TFT_GREENYELLOW
                        //        #define DISP_TX_BCOL   DISP_BCOL
                        //        // status line for messages
                        //        #define USE_STAT_TOUCH OFF
                        //        #define STATUS_XCENT   120 // Centred on this
                        //        #define STATUS_YCENT   315
                        //        #define STATUS_XLI     0
                        //        #define STATUS_XRE     239
                        //        #define STATUS_YOB     DISP_H // 300
                        //        #define STATUS_YUN     319
                        //        #define STATUS_FCOL    0xF81F // TFT_MAGENTA
                        //        #define STATUS_BCOL    0x0000 // TFT_BLACK
                  #endif
                #ifdef UNUSED // TFT_TYP == MC_UO_TFT1602_GPIO_RO)
                    #define DATE_DISP_COL   0
                    //        #define DATE_DISP_LINE  0    // line on display for date / time
                    //        #define LCD_ROWS        2
                    //        #define LCD_CULS        2
                  #endif
                #ifdef USE_TFT_GC9A01
                    #if (PRJ_BOARD == MC_ESP32_NODE)
                        #ifdef TFT_CS
                            #define PIN_TFT_CS  TFT_CS
                          #else
                            #ifndef PIN5 // PIN_SPI_MOSI
                                #define PIN_TFT_CS         5
                                #define PIN5
                              #else
                                PIN5 adready used
                              #endif // PIN5
                          #endif
                        #ifdef TFT_DC
                            #define PIN_TFT_DC  TFT_DC
                          #else
                            #ifndef PIN26 // PIN_TFT_DC
                                #define PIN_TFT_DC        26
                                #define PIN26
                              #else
                                PIN26 adready used
                              #endif // PIN26
                          #endif
                        #ifdef TFT_RST
                            #define PIN_TFT_RST  TFT_RST
                          #else
                            #ifndef PIN33 // PIN_TFT_RST
                                #define PIN_TFT_RST       33 //
                                #define PIN_33
                              #else
                                PIN33 adready used
                              #endif // PIN18
                          #endif //PRJ_BOARD
                      #endif
                    #define DATE_DISP_COL   0
                    #define DISP_MAXCOLS     30
                            //        #define DATE_DISP_LINE  0    // line on display for date / time
                            //        #define LCD_ROWS        2
                            //        #define LCD_CULS        2
                  #endif
              #endif
              // --- SPI board connection
            #if (USE_TYPE_K_SPI > OFF)
                //#if (USE_TYPE_K_SPI > OFF)
                //    #define TYPEK_DATA_PIN      PIN_SPI_MISO
                //    #define TYPEK_CLK_PIN       PIN_SPI_SCLK
                //    #define TYPEK1_CS_PIN       16
                //    #define TYPEK2_CS_PIN       17
                //  #endif
                #define TYPEK_FILT      11        // floating  measure filtering
                #define TYPEK_DROP_PEEK 2         // drop biggest / lowest
                #define TYPEK1_OFFSET   0.        // offset unit °C
                #define TYPEK1_GAIN     1.        // result = (measure * gain) + offset
                #if (USE_TYPE_K_SPI > OFF)
                    #define TYPEK2_OFFSET   0.        // offset unit °C
                    #define TYPEK2_GAIN     1.        // result = (measure * gain) + offset
                  #endif
                #if (USE_MQTT > OFF)
                    #define TYPEK1_MQTT           "ttypek-1"
                    #define TYPEK2_MQTT           "ttypek-2"
                  #endif
                #ifndef USE_INPUT_CYCLE
                    #define USE_INPUT_CYCLE
                  #endif
              #endif
          #endif // USE_SPI
      // --- serial interface
      // --- analog connection
        #if (USE_MQ135_GAS_ANA > OFF)
            #define MQ135_GAS_ADC             ON
            #define MQ135_GAS_1115            OFF
            #define MQ135_FILT                15       // floating  measure filtering
            #define MQ135_EM_WIN              100      // window for traffic light
            #define MQ135_SCAL_MIN            0
            #define MQ135_SCAL_MAX            100
              //#define MQ135_ThresFilt       25       // threshold measure filtering
              //#define MQ135_EM_MID          2350    // green < (MID-(WIN/2) < yellow < (MID+(WIN/2) < red
            #ifndef USE_INPUT_CYCLE
                #define USE_INPUT_CYCLE
              #endif
          #endif
        #if (USE_MQ3_ALK_ANA > OFF)
            #define MQ3_FILT                  5       // floating  measure filtering
            #define MQ3_DROP                  1
            #define MQ3_EM_WIN                100      // window for traffic light
            #define MQ3_SCAL                  OFF
            #define MQ3_ALK_ADC               OFF
            #define MQ3_ALK_1115              ON
            #if (MQ3_ALK_1115 > OFF)
                #define MQ3_1115_UNIDX          0
                #define MQ3_1115_CHIDX         3
                #define MQ3_1115_ATT          GAIN_TWOTHIRDS
                #define MQ3_OFFRAW            0
                #define MQ3_GAIN              0
                #define MQ3_OFFREAL           0
              #endif
            #if (USE_MQTT > OFF)
                #define MQTT_MQ3              "alc"
              #endif
            #ifndef USE_INPUT_CYCLE
                #define USE_INPUT_CYCLE
              #endif
          #endif
        #if (USE_PHOTO_SENS_ANA > OFF)
            #define PHOTO1_FILT               0
            #define PHOTO1_DROP               1
            #define PHOTO1_ADC                ON
            #if (PHOTO1_ADC > OFF)
                #define PHOTO1_ADC_ATT        ADC_ATTEN_DB_11
                #define PHOTO1_SCAL_OFFRAW    0
                #define PHOTO1_SCAL_GAIN      0.02442
                #define PHOTO1_SCAL_OFFREAL   0
              #endif
            #define PHOTO1_1115               OFF
              #if (PHOTO1_1115 > OFF)
                  #define PHOTO1_1115_UNIDX     0
                  #define PHOTO1_1115_CHIDX    0
                  #define PHOTO1_1115_ATT     GAIN_ONE
                  #define PHOTO1_SCAL_OFFRAW  0
                  #define PHOTO1_SCAL_GAIN    1
                  #define PHOTO1_SCAL_OFFREAL 0
                #endif
            #if (USE_MQTT > OFF)
                #define MQTT_PHOTO1           "photo1"
              #endif
            #if (USE_PHOTO_SENS_ANA > 1)
                #define PHOTO2_FILT           7
                #define PHOTO2_DROP           0
                #define PHOTO2_SCAL           OFF
                #define PHOTO2_SCAL_MIN       0
                #define PHOTO2_SCAL_MAX       100
                #define PHOTO2_ADC            ON
                #if (PHOTO2_ADC > OFF)
                    #define PHOTO2_ADC_ATT  ADC_ATTEN_DB_11
                  #endif
                #define PHOTO2_1115           OFF
                #if (PHOTO2_1115 > OFF)
                    #define PHOTO2_1115_ATT  GAIN_ONE
                    #define PHOTO2_1115_UNIDX  0
                    #define PHOTO2_1115_CHIDX 0
                  #endif
                #if (USE_MQTT > OFF)
                    #define MQTT_PHOTO2           "licht2"
                  #endif
              #endif
            #ifndef USE_INPUT_CYCLE
                #define USE_INPUT_CYCLE
              #endif
          #endif
        #if (USE_VCC_ANA > OFF)
            //      #define VCC_FILT                0
            //      #define VCC_DROP                1
            //      #if (USE_VCC50_ANA > OFF)
            //          #define VCC50_ADC           OFF
            //          #define VCC50_1115          ON
            //          #if (VCC50_ADC > OFF)
            //              #define VCC50_ADC_ATT       ADC_ATTEN_DB_11
            //              #define VCC50_SCAL          OFF
            //              #define VCC50_SCAL_OFFRAW   0
            //              #define VCC50_SCAL_GAIN     1
            //              #define VCC50_SCAL_OFFREAL  0
            //            #endif
            //          #if (VCC50_1115 > OFF)
            //              #define VCC_1115_UNIDX     0
            //              #define VCC50_1115_CHIDX   2    //
            //              #define ADS13_GAIN        GAIN_TWOTHIRDS
            //              #define ADS13_RATE        RATE_ADS1115_128SPS
            //              #define ADS13_MUX         ADS1X15_MUX_SINGLE
            //              #define VCC50_SCAL        ON
            //              #define VCC50_OFFRAW      0
            //              #define VCC50_GAIN        2
            //              #define VCC50_OFFREAL     0
            //            #endif
            //          #if (USE_MQTT > OFF)
            //              #define MQTT_VCC50        "vcc50"
            //            #endif
            //        #endif
            //      #if (USE_VCC33_ANA > OFF)
            //          #define VCC33_ADC         OFF
            //          #define VCC33_1115        ON
            //          #if (VCC33_1115 > OFF)
            //              #define VCC33_1115_UNIDX   0
            //              #define VCC33_1115_CHIDX   3    //
            //              #define ADS11_GAIN        GAIN_TWOTHIRDS
            //              #define ADS11_RATE        RATE_ADS1115_128SPS
            //              #define ADS11_MUX         ADS1X15_MUX_SINGLE
            //              #define VCC33_SCAL        OFF
            //              #define VCC33_OFFRAW      0
            //              #define VCC33_GAIN        1
            //              #define VCC33_OFFREAL     0
            //            #endif
            //          #if (USE_MQTT > OFF)
            //              #define MQTT_VCC33          "vcc33"
            //            #endif
            //        #endif
            //      #ifndef USE_INPUT_CYCLE
            //          #define USE_INPUT_CYCLE
            //        #endif
          #endif
        #if (USE_POTI_ANA > OFF)
            //      #define POTI1_FILT              9
            //      #define POTI1_DROP              1
            //      #define POTI1_ADC               OFF
            //      #if (POTI1_ADC > OFF)
            //          #define POTI1_ADC_ATT     ADC_ATTEN_DB_11
            //          #define VCC_SCAL_OFFRAW   0
            //          #define VCC_SCAL_GAIN     1
            //          #define VCC_SCAL_OFFREAL  0
            //        #endif
            //      #define POTI1_1115              ON
            //      #if (POTI1_1115 > OFF)
            //          #define POTI1_1115_UNIDX    0
            //          #define POTI1_1115_CHIDX    0
            //          #define ADS14_GAIN          GAIN_TWOTHIRDS
            //          #define ADS14_RATE          RATE_ADS1115_128SPS
            //          #define ADS14_MUX           ADS1X15_MUX_SINGLE
            //          #define POTI1_OFFRAW        0
            //          #define POTI1_GAIN          1
            //          #define POTI1_OFFREAL       0
            //        #endif
            //      #if (USE_MQTT > OFF)
            //          #define MQTT_POTI1          "poti1"
            //        #endif
            //      #if (USE_POTI_ANA > 1)
            //          #define POTI2_FILT          7
            //          #define POTI2_DROP          0
            //          #define POTI2_SCAL          OFF
            //          #define POTI2_SCAL_MIN      0
            //          #define POTI2_SCAL_MAX      100
            //          #define POTI2_ADC           ON
            //          #if (POTI2_ADC > OFF)
            //              #define POTI2_ADC_ATT   ADC_ATTEN_DB_11
            //            #endif
            //          #define POTI2_1115            OFF
            //          #if (POTI2_1115 > OFF)
            //              #define POTI2_1115_UNIDX  0
            //              #define POTI2_1115_CHIDX 0
            //              #define POTI2_1115_ATT  GAIN_TWOTHIRDS
            //            #endif
            //          #if (USE_MQTT > OFF)
            //              #define MQTT_POTI2          "poti2"
            //            #endif
            //        #endif
            //      #ifndef USE_INPUT_CYCLE
            //          #define USE_INPUT_CYCLE
            //        #endif
          #endif
        #if (USE_ACS712_ANA > OFF)
            /*  ACS712 hall effect current sensor +/- 5A/20A/30 A
                output: VCC/2 (2,5V) + measured value
                sensitivity: type  5A -> 186mV/A ->  1570 - 3430 mV
                sensitivity: type 20A -> 100mV/A ->   500 - 4500 mV
                sensitivity: type 30A ->  66mV/A ->   520 - 4480 mV
              */
            #define I712_FILT               0
            #define I712_DROP               0
            #define I712_1_IMAX             5000 // mA
            #define I712_1_ADC              OFF // not recommended, low resolution
            #if (I712_1_ADC > OFF)
                #define I712_1_ADC_ATT   ADC_ATTEN_DB_11
              #endif
            #define I712_1_1115             ON
            #if (I712_1_1115 > OFF)
                #define I712_1_1115_UNIDX    0
                #define I712_1_1115_CHIDX    1
                #if   (I712_1_IMAX ==  5000)
                    #define ADS12_GAIN            GAIN_TWOTHIRDS
                    #define ADS12_RATE            RATE_ADS1115_128SPS
                    #define ADS12_MUX             ADS1X15_MUX_SINGLE
                    #define I712_1_SCAL_OFFRAW    0
                    #define I712_1_SCAL_GAIN      185
                    #define I712_1_SCAL_OFFREAL   0
                  #endif
                #if (I712_1_IMAX == 20000)
                    #define ADS12_GAIN            GAIN_ONE
                    #define ADS12_RATE            RATE_ADS1115_128SPS
                    #define ADS12_MUX             ADS1X15_MUX_SINGLE
                    #define I712_1_SCAL_OFFRAW    0
                    #define I712_1_SCAL_GAIN      1
                    #define I712_1_SCAL_OFFRAW    0
                  #endif
                #if (I712_1_IMAX == 30000)
                    #define ADS12_GAIN            GAIN_ONE
                    #define ADS12_RATE            RATE_ADS1115_128SPS
                    #define ADS12_MUX             ADS1X15_MUX_SINGLE
                    #define I712_1_SCAL_OFFRAW    0
                    #define I712_1_SCAL_GAIN      1
                    #define I712_1_SCAL_OFFRAW    0
                  #endif
                #if (USE_MQTT > OFF)
                    #define MQTT_I712_1         "acs7121"
                  #endif
              #endif
            #if (USE_ACS712_ANA > 1)
                #define I712_2_IMAX             5000 // mA
                #define I712_2_ADC              OFF // not recommended, low resolution
                #define I712_2_1115             ON
                #if (I712_2_ADC > OFF)
                    #define I712_2_ADC_ATT   ADC_ATTEN_DB_11
                  #endif
                #if (I712_2_1115 > OFF)
                    #define I712_2_1115_UNIDX     0
                    #define I712_2_1115_CHIDX    2
                    #if  (I712_2_IMAX ==  5000)
                        #define I712_2_1115_ATT       GAIN_ONE
                        #define I712_2_SCAL_OFFRAW    0
                        #define I712_2_SCAL_GAIN      1
                        #define I712_2_SCAL_OFFREAL   0
                      #endif
                    #if (I712_2_IMAX == 20000)
                        #define I712_2_1115_ATT      GAIN_TWOTHIRDS
                        #define I712_2_SCAL_OFFRAW    0
                        #define I712_2_SCAL_GAIN      1
                        #define I712_2_SCAL_OFFRAW    0
                      #endif
                    #if (I712_2_IMAX == 30000)
                        #define I712_2_1115_ATT      GAIN_TWOTHIRDS
                        #define I712_2_SCAL_OFFRAW    0
                        #define I712_2_SCAL_GAIN      1
                        #define I712_2_SCAL_OFFRAW    0
                      #endif
                    #if (USE_MQTT > OFF)
                        #define MQTT_I712_1         "acs7121"
                        #define MQTT_I712_2         "acs7122"
                      #endif
                  #endif
              #endif
          #endif
      // --- network
        // --- WIFI
          #define UTC_SEASONTIME UTC_SUMMERTIME
          #if defined(USE_WIFI)
              #if defined(USE_NTP_SERVER)
                  #if not defined(USE_OUTPUT_CYCLE)
                      #define USE_OUTPUT_CYCLE
                    #endif
                  #define NTPSERVER_CYCLE 1000ul   // Intervallzeit [us]
                #endif // USE_NTP_SERVER
              #define WIFI_ANZ_LOGIN  8
              #define WIFI_IS_DUTY    ON
              #define WIFI_SSID0      "M&M_mobil"   // Bauwagen
              #define WIFI_SSID0_PW   "M&M2KsR&N#"
              #define WIFI_SSID1      "MAMD-HomeG" // WLAN Moosgrabenstrasse 26
              #define WIFI_SSID1_PW   "ElaNanniRalf3"
              #define WIFI_SSID2      "HS-HomeG" // WLAN Am Jungberg 9
              #define WIFI_SSID2_PW   "ElaNanniRalf3"
              #define WIFI_SSID3      "WL-Fairnetz" //Weltladen
              #define WIFI_SSID3_PW   "WL&Fair2Live#"
              #define WIFI_SSID4      "MachNet" //machQuadrat
              #define WIFI_SSID4_PW   "!Machquadrat1"
              #define WIFI_SSID5      "MD_KingKong" //Hotspot Martin
              #define WIFI_SSID5_PW   "ElaNanniRalf3"
              #define WIFI_SSID6      "CDWiFi"        //OEBB Raijet
              #define WIFI_SSID6_PW   ""
              #define WIFI_SSID7      "xWIFI@DB"        //DB ICE
              #define WIFI_SSID7_PW   ""
              #define WIFI_SSID8      ""        //?
              #define WIFI_SSID8_PW   ""
              #define WIFI_SSID9      ""    // ?
              #define WIFI_SSID9_PW   ""
              #define WIFI_CONN_DELAY 500000ul // Scan-Abstand [us]
              #define WIFI_CONN_REP   5        // Anzahle der Connect-Schleifen
              #define WIFI_CONN_CYCLE 4000ul   // Intervallzeit fuer Recoonect [us]
              #define WIFI_ANZ_LOCIP  WIFI_ANZ_LOGIN
              #if defined(USE_FIXIP)
                  #define WIFI_FIXIP        0x01000000ul * USE_FIXIP
                  #define WIFI_GATEWAY0     0x0100000Aul // 10.0.0.1        // Bauwagen
                  #define WIFI_FIXIP0       0x0000000Aul + WIFI_FIXIP
                  #define WIFI_GATEWAY1     0x8B00000Aul // 10.0.0.139      // Moosgraben
                  #define WIFI_FIXIP1       0x0000000Aul + WIFI_FIXIP
                  #define WIFI_GATEWAY2     0x8B00000Aul // 10.0.0.139      // Jungberg
                  #define WIFI_FIXIP2       0x0000000Aul + WIFI_FIXIP
                  #define WIFI_GATEWAY3     0x8A00000Aul // 10.0.0.138      // Weltladen
                  #define WIFI_FIXIP3       0x1600000Aul // 10.0.0.22
                  #define WIFI_GATEWAY4     0x01250D0Aul // 10.0.0.1        // machquadrat
                  #define WIFI_FIXIP4       0x6F250D0Aul // 10.0.0.22
                  #define WIFI_GATEWAY5     0x012BA8C0ul // 192.168.43.154  // hotspot KingKong
